import type { NextPage } from "next";
import NextHeadSeo from "next-head-seo";
import { ListItem, UnorderedList } from "@chakra-ui/react";
import { TextPageLayout, Content } from "../layouts/TextPage";
import { canonicalUrl } from "../utils/canonicalUrl";

const Teams: NextPage = () => {
  return (
    <>
      <NextHeadSeo
        title="利用規約"
        description="o-fulの利用規約"
        canonical={canonicalUrl("/teams")}
      />
      <TextPageLayout title="利用規約">
        <Content title="第1条（定義）">
          この規約（以下「本規約」といいます。）は、https://o-ful.vercel.app/（以下「本サイト」といいます。）上から閲覧等できるo-ful（以下「本サービス」といいます。）の利用の諸条件を定めるものです。
          本規約とは別に本サイトが別途定める諸規定は、それぞれ本規約の一部を構成するものとします。
        </Content>

        <Content title="第2条（規約への同意）">
          ユーザーは、本規約の定めに従って本サービスを利用しなければなりません。
          ユーザーは、本規約に同意をしない限り本サービスを利用できません。
          本サービスにおいて個別利用条件がある場合、ユーザーは、本規約のほか個別利用条件の定めにも従って本サービスを利用しなければなりません。
        </Content>

        <Content title="第3条（規約の変更）">
          本サービスは、本サービスが必要と判断する場合、本サービスの目的の範囲内で、本規約を変更することができます。
          その場合、本サービスは、変更後の本規約の内容を、本サイトに表示し、本サービスが定める方法によりユーザーに通知することでユーザーに周知します。
          変更後の本規約は、本サービスが別途定める場合を除き、本サービス上に表示した時点より効力を生じるものとします。
          当該変更後、ユーザーが本サービスを利用した場合、ユーザーは、本規約の変更に同意したものとみなします。
        </Content>

        <Content title="第4条（アカウント）">
          本サービスの利用に際して、情報を登録のうえ、アカウントの作成が必要となる場合があります。
          この場合、ユーザーは、真実、正確かつ完全な情報を登録しなければならず、常に最新の情報となるよう修正しなければなりません。
          ユーザーは、本サービスの利用に際して認証情報を登録する場合、これを不正に利用されないようユーザーご自身の責任で厳重に管理しなければなりません。
          本サービスは、登録された認証情報を利用して行われた一切の行為を、ユーザーご本人の行為とみなすことができます。
          本サービスは、最終のアクセスから１年間以上経過しているアカウントを、あらかじめユーザーに通知することなく削除することができます。
          ユーザーの本サービスにおけるすべての利用権は、理由を問わず、アカウントが削除された時点で消滅します。
          ユーザーが誤ってアカウントを削除した場合であっても、アカウントの復旧はできませんのでご注意ください。
          本サービスのアカウントは、ユーザーに一身専属的に帰属します。
          ユーザーの本サービスにおけるすべての利用権は、第三者に譲渡、貸与その他の処分または相続させることはできません。
        </Content>

        <Content title="第5条（プライバシー）">
          本サービスは、ユーザーのプライバシーを尊重しています。
          本サービスは、ユーザーのプライバシー情報と個人情報を、プライバシーポリシーに従って適切に取り扱います。
          本サービスは、ユーザーから収集した情報を安全に管理するため、セキュリティに最大限の注意を払っています。
        </Content>

        <Content title="第6条（サービスの提供）">
          本サービスは、本サービスの全部または一部を、年齢、本人確認の有無、登録情報の有無、その他、本サービスが必要と判断する条件を満たしたユーザーに限定して提供することができます。
          本サービスは、本サービスが必要と判断する場合、あらかじめユーザーに通知することなく、いつでも、本サービスの全部または一部の内容を変更することができます。
          本サービスは、以下のいずれかに該当する場合、あらかじめユーザーに通知することなく、本サービスの全部または一部の提供を中止することができます。
          <UnorderedList>
            <ListItem>
              システムのメンテナンスまたは修理の実施を行う場合
            </ListItem>
            <ListItem>
              火災・停電等の事故、天災、戦争等の不可抗力により、本サービスの提供ができなくなった場合
            </ListItem>
            <ListItem>
              システムの障害が発生した場合またはシステムに負荷が集中した場合
            </ListItem>
            <ListItem>
              ユーザーまたは第三者の安全を確保する場合または公共の利益のために緊急を要する場合
            </ListItem>
            <ListItem>
              上記に定めるもののほか、本サービスが必要と判断した場合
            </ListItem>
          </UnorderedList>
        </Content>

        <Content title="第7条（ 本サービス以外の第三者のサービス）">
          本サービスは、本サービス以外の第三者が提供するサービスまたはコンテンツを含む場合があります。
          かかるサービスまたはコンテンツに対する責任は、これを提供する第三者が負います。
          また、かかるサービスまたはコンテンツには、これを提供する第三者が定める利用規約その他の条件が適用されることがあります。
        </Content>

        <Content title="第8条（禁止事項）">
          本サービスは、本サービスに関するユーザーによる以下の行為を禁止します。
          <UnorderedList>
            <ListItem>
              法令、裁判所の判決、決定もしくは命令、または法令上拘束力のある行政措置に違反する行為
            </ListItem>
            <ListItem>
              公の秩序または善良の風俗に反するおそれのある行為{" "}
            </ListItem>
            <ListItem>
              本サービスまたは第三者の著作権、商標権、特許権等の知的財産権、名誉権、プライバシー権、その他法令上または契約上の権利を侵害する行為
            </ListItem>
            <ListItem>
              過度に暴力的な表現、露骨な性的表現、児童ポルノ・児童虐待に相当する表現、人種、国籍、信条、性別、社会的身分、門地等による差別につながる表現、自殺、自傷行為、薬物乱用を誘引または助長する表現、その他反社会的な内容を含み他人に不快感を与える表現を、投稿または送信する行為
            </ListItem>
            <ListItem>
              本サービスまたは第三者になりすます行為または意図的に虚偽の情報を流布させる行為
            </ListItem>
            <ListItem>
              同一または類似の投稿を送信する行為（本サービスの認めたものを除きます。）、その他本サービスがスパムと判断する行為
            </ListItem>
            <ListItem>
              営業、宣伝、広告、勧誘、その他営利を目的とする行為（本サービスの認めたものを除きます。）、性行為やわいせつな行為を目的とする行為、面識のない第三者との出会いや交際を目的とする行為、他のユーザーに対する嫌がらせや誹謗中傷を目的とする行為、その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為
            </ListItem>
            <ListItem>反社会的勢力に対する利益供与その他の協力行為</ListItem>
            <ListItem>宗教活動または宗教団体への勧誘行為</ListItem>
            <ListItem>
              他人の個人情報、登録情報、利用履歴情報等を、不正に収集、開示または提供する行為
            </ListItem>
            <ListItem>
              本サービスのサーバやネットワークシステムに支障を与える行為、BOT、チートツール、その他の技術的手段を利用して本サービスを不正に操作する行為、本サービスの不具合を意図的に利用する行為、同様の質問を必要以上に繰り返す等、本サービスに対し不当な問い合わせまたは要求をす
              る行為、その他本サービスによる本サービスの運営または他のユーザーによる本サービスの利用を妨害し、これらに支障を与える行為
            </ListItem>
            <ListItem>
              不当な目的または態様でのリバースエンジニアリング、逆アセンブルを行う行為、その他の方法でソースコードを解読する行為
            </ListItem>
            <ListItem>
              上記までのいずれかに該当する行為を援助または助長する行為
            </ListItem>
            <ListItem>
              上記に定めるもののほか、本サービスが不適当と合理的に判断した行為
            </ListItem>
          </UnorderedList>
        </Content>

        <Content title="第9条（ユーザーの責任）">
          ユーザーは、ユーザーご自身の責任において本サービスを利用するものとし、本サービスにおいて行った一切の行為およびその結果について一切の責任を負うものとします。
          本サービスは、投稿等が本規約に抵触するか否かを積極的に監視する義務を負うものではありません。
          本サービスは、ユーザーが以下のいずれかに該当する場合または該当するおそれがある場合、あらかじめユーザーに通知することなく、本サービスの全部または一部の利用の停止、アカウントの停止または削除、本サービスに関するユーザーと本サービスとの間の契約（本規約に基づく契約を含みます。以下同じ。）の解除その他の本サービスが必要かつ適切と合理的に判断する措置を講じることができます。
          <UnorderedList>
            <ListItem>
              適用のある法令または本規約もしくは個別利用条件に違反した場合
            </ListItem>
            <ListItem>反社会的勢力の構成員またはその関係者である場合</ListItem>
            <ListItem>
              風説の流布、偽計、威力その他の不正な手段を用いて本サービスの信用を毀損する場合
            </ListItem>
            <ListItem>
              差押え、仮差押えもしくは競売の申立てを受けた場合、または破産手続開始、民事再生手続開始もしくはこれらに類する手続の開始の申立てがあった場合その他ユーザーの信用不安が発生したと本サービスが合理的に判断した場合
            </ListItem>
            <ListItem>
              上記に定めるもののほか、ユーザーとの信頼関係が失われた場合その他ユーザーへの本サービスの提供が適切でないと本サービスが合理的に判断した場合
            </ListItem>
          </UnorderedList>
          ユーザーは、本サービスを利用したことに起因して（本サービスがかかる利用を原因とするクレームを第三者より受けた場合を含みます。）、本サービスが直接的または間接的に何らかの損害（弁護士費用の負担を含みます。）を被った場合、本サービスの請求にしたがって直ちにこれを賠償しなければなりません。
        </Content>

        <Content title="第10条（投稿、出品、購入、取引、支払い）">
          <UnorderedList>
            <ListItem>
              ユーザーは、本サービスの指定する「出品物ガイドライン」に記載のある出品禁止物を出品することはできません。
              本サービスは、「出品物ガイドライン」に記載のある出品禁止物又は本サービスが不適切と判断する商品が出品された場合、その出品を削除するとともに、本規約違反の行為がなされたものとみなします。
              本サービスは、本項に定める本規約違反行為がなされた場合、出品に関する投稿の削除、アカウントの停止もしくは削除を行うことができます。
              本サービスは、ユーザーの出品によって、ユーザー及び第三者に生じる損害について、本サービスの故意又は重過失に起因する場合を除き、一切の責任を負わないものとします。
            </ListItem>
            <ListItem>
              リアルタイムで情報が更新されない都合上、同時に申し込みが複数件入る可能性がありますが、その際に誰を優先するかは出品をしたユーザーが決めることができます。
            </ListItem>
            <ListItem>
              ユーザーは、購入意思のない連絡（いたずら目的などを含みますがそれらに限られません。）をすることはできません。
              本サービスは、ユーザーの購入手続によって、ユーザー及び第三者に生じる損害について、本サービスの故意又は重過失に起因する場合を除き、一切の責任を負わないものとします。
            </ListItem>
            <ListItem>
              ユーザー間の売買契約は、双方の合意のもと成立するものとします。
              ユーザー間で商品等に関してトラブルが発生した場合、当事者の費用と責任によって解決されるものとします。
              本サービスは、円滑な運営のために必要と判断した場合、ユーザー間のトラブルに介入する場合があります。
            </ListItem>
            <ListItem>
              ユーザー間の売買契約は、双方の合意のもと取引を中止することができます。
            </ListItem>
          </UnorderedList>
        </Content>

        <Content title="第11条（非保証）">
          本サービスは、本サービスに関する瑕疵（セキュリティ等に関する欠陥、エラーやバグ、権利侵害を含みます。）がないこと、ならびに安全性、信頼性、正確性、完全性、有効性および特定の目的への適合性を明示的にも黙示的にも保証していません。
          本サービスは、ユーザーに対して、かかる瑕疵を除去して本サービスを提供する義務を負いません。
        </Content>

        <Content title="第12条（本サービスの免責）">
          本サービスは、本サービスの故意または重過失に起因する場合を除き、本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。
        </Content>

        <Content title="第13条（本規約と法令の関係）">
          本規約の規定が本サービスに関するユーザーと本サービスとの間の契約に適用される消費者契約法その他の法令に反するとされる場合、当該規定は、その限りにおいて、ユーザーとの契約には適用されないものとします。
          ただし、この場合でも、本規約の他の規定の効力に影響しないものとします。
        </Content>

        <Content title="第14条（連絡方法）">
          本サービスに関する本サービスからユーザーへの連絡は、本サービスまたは本サービスウェブサイト内の適宜の場所への掲示その他、本サービスが適当と判断する方法により行います。
          本サービスに関するユーザーから本サービスへの連絡は、本サービスまたは本サービスウェブサイト内の適宜の場所に設置するお問い合わせフォームの送信または本サービスが指定する方法により行っていただきます。
        </Content>

        <Content title="第15条（準拠法）">
          本規約は日本語を正文とし、その準拠法は日本法とします。
        </Content>
      </TextPageLayout>
    </>
  );
};

export default Teams;
